harviswang/linux-3.10.99/arch/mips/m200/inc/hw_cpm.h
//*****************************************************************************
//
// hw_cpm.h - Macros used when accessing the Clock Power Management hardware.
//
// Copyright (c) 2017 Harvis Wang.  All rights reserved.
// Software License Agreement
// 
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
// 
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the  
//   distribution.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#ifndef __HW_CPM_H__
#define __HW_CPM_H__

//*****************************************************************************
//
// The following are defines for the CPM register offsets.
//
//*****************************************************************************
#define CPM_O_CCR               0x00000000  // Clock Control Register
#define CPM_O_LCR               0x00000004  // Low Power Control Register
#define CPM_O_PCR               0x0000000C  // PLL Control Register
#define CPM_O_APCR              0x00000010  // APLL Control Register
#define CPM_O_MPCR              0x00000014  // MPLL Control Register
#define CPM_O_APACR             0x00000018  // APLL Fraction Register
#define CPM_O_MPACR             0x0000001C  // MPLL Fraction Register
#define CPM_O_CLKGR0            0x00000020  // Clock Gate Register0
#define CPM_O_OPCR              0x00000024  // Oscillator and Power Control Register
#define CPM_O_CLKGR1            0x00000028  // Clock Gate Register1
#define CPM_O_DDRCDR            0x0000002C  // DDR clock divider Register
#define CPM_O_VPUCDR            0x00000030  // VPU clock divider Register
#define CPM_O_SPR               0x00000034  // CPM Scratch Pad Register
#define CPM_O_SPPR              0x00000038  // CPM Scratch Protected Register
#define CPM_O_USBPCR0           0x0000003C  // USB Parameter control register 0
#define CPM_O_USBRDT            0x00000040  // USB Reset Detect Timer Register
#define CPM_O_USBVBFIL          0x00000044  // USB jitter filter Register
#define CPM_O_USBPCR1           0x00000048  // USB Parameter control register 1
#define CPM_O_USBCDR            0x00000050  // OTG PHY clock divider Register
#define CPM_O_I2SCDR            0x00000060  // I2S device clock divider Register
#define CPM_O_LCDPCDR           0x00000064  // LCD Pixel clock divider Register
#define CPM_O_MSC0CDR           0x00000068  // MSC0 clock divider Register
#define CPM_O_UHCCDR            0x0000006C  // UHC 48M clock divider Register
#define CPM_O_SSICDR            0x00000074  // SSI clock divider Register
#define CPM_O_CIMCDR            0x0000007C  // CIM MCLK clock divider Register
#define CPM_O_ISPCDR            0x00000080  // HDMI clock divider Register
#define CPM_O_PCMCDR            0x00000084  // PCM device clock divider Register
#define CPM_O_GPUCDR            0x00000088  // GPU clock divider Register
#define CPM_O_PSWC0ST           0x00000090  // Power Switch Chain0 Start Time
#define CPM_O_PSWC1ST           0x00000094  // Power Switch Chain1 Start Time
#define CPM_O_PSWC2ST           0x00000098  // Power Switch Chain2 Start Time
#define CPM_O_PSWC3ST           0x0000009C  // Power Switch Chain3 Start Time
#define CPM_O_MSC1CDR           0x000000A4  // MSC1 clock divider Register
#define CPM_O_MSC2CDR           0x000000A8  // MSC2 clock divider Register
#define CPM_O_BCHCDR            0x000000AC  // BCH clock divider Register
#define CPM_O_INTR              0x000000B0  // CPM interrupt Register
#define CPM_O_INTRE             0x000000B4  // CPM interrupt Enable Register
#define CPM_O_SPCR0             0x000000B8  // SRAM Power Control Register0
#define CPM_O_SRBC              0x000000C4  // Soft Reset and Bus Control Register
#define CPM_O_SLBC              0x000000C8  // Sleep Boot Control Register
#define CPM_O_SLPC              0x000000CC  // Sleep PC Register
#define CPM_O_DDRCGR            0x000000D0  // DDR clock gate register
#define CPM_O_CSR               0x000000D4  // Clock status register
#define CPM_O_ERNG              0x000000D8  // Enable rng regsiter
#define CPM_O_RNG               0x000000DC  // rng regsiter
#define CPM_O_PGR               0x000000E4  // Power Gate Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_CCR register.
// Note: 1. the frequency of CCLK must be 2,3 or 4 times of the frequency of L2CLK
//       2. the frequency of H2CLK must be 1 or 2 times of the frequency of PCLK
//
//*****************************************************************************
#define CPM_CCR_SELSRC          0xC0000000  // Select the clock source for SCLK_A(the MUX clock output)
                                            // 00: stop MUX clock output
                                            // 01: APLL
                                            // 10: EXCLK
#define CPM_CCR_SELCPLL         0x30000000  // Select the clock source for CPU and L2Cache
                                            // 00: stop MUX clock output
                                            // 01: SCLK_A
                                            // 10: MPLL
#define CPM_CCR_SELH0PLL        0x0C000000  // Select the clock source for AHB0 bus
                                            // 00: stop MUX clock output
                                            // 01: SCLK_A
                                            // 10: MPLL
#define CPM_CCR_SELH2PLL        0x03000000  // Select the clock source for AHB2 bus and PCLK
                                            // 00: stop MUX clock output
                                            // 01: SCLK_A
                                            // 10: MPLL
#define CPM_CCR_GATESCLKA       0x00800000  // 0: SCLK_A not gating
                                            // 1: SCLK_A is gating
                                            // Gating module: LCD GPU VPU ISP MSC BCH AIC USB UHC SSI PCM CIM_MCLK etc
#define CPM_CCR_CECPU           0x00400000  // 0: Can't write CDIV and L2CDIV
                                            // 1: Could write CDIV and L2CDIV
#define CPM_CCR_CEAHB0          0x00200000  // 0: Can't write H0DIV
                                            // 1: Could write H0DIV
#define CPM_CCR_CEAHB2          0x00100000  // 0: Can't write H2DIV and PDIV
                                            // 1: Could write H2DIV and PDIV
#define CPM_CCR_PDIV            0x000F0000  // Divider for Peripheral Frequency. Specified the PCLK division ratio
                                            // 1/1 ~ 1/14, PDIV=15 and CEAHB2=1 will stop PCLK
                                            //             PDIV=14 and CEAHB2=1 PCLK will continue run(exit stop status)
#define CPM_CCR_H2DIV           0x0000F000  // Divider for AHB2 Frequency. Specified the AHB2 CLK division ratio
                                            // 1/1 ~ 1/14, H2DIV=15 and CEAHB2=1 will stop H2CLK
                                            //             H2DIC=14 and CEAHB2=1 H2CLK will continue run(exit stop status)
#define CPM_CCR_H0DIV           0x00000F00  // Divider for AHB0 Frequency. Specified the AHB0 CLK division ratio
                                            // 1/1 ~ 1/14, H0DIV=15 and CEAHB0=1 will stop H0CLK
                                            //             H0DIC=14 and CEAHB0=1 H0CLK will continue run(exit stop status)
#define CPM_CCR_L2CDIV          0x000000F0  // Divider for L2CACHE Frequency. Specified the L2CLK division ratio
                                            // 1/1 ~ 1/14, L2CDIV=15 and CECPU=1 will stop L2CLK
                                            //             L2CDIC=14 and CECPU=1 L2CLK will continue run(exit stop status)
#define CPM_CCR_CDIV            0x0000000F  // Divider for CPU Frequency. Specified the CPU CLK division ratio
                                            // 1/1 ~ 1/14, CDIV=15 and CECPU=1 will stop CPU CLK
                                            //             CDIC=14 and CECPU=1 CPU CLK will continue run(exit stop status)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_LCR register.
//
//*****************************************************************************
#define CPM_LCR_PDP0            0x80000000  // Power Down big core CPU
                                            // 0: not shut down power supply to big core CPU
                                            // 1: shut down power supply to big core CPU
#define CPM_LCR_PDP1            0x40000000  // Power Down small core CPU
#define CPM_LCR_PDVPU           0x20000000  // Power Down Module VPU
#define CPM_LCR_PDGPU           0x10000000  // Power Down Module GPU
#define CPM_LCR_PDISP           0x08000000  // Power Down Module ISP
#define CPM_LCR_PDH2D           0x04000000  // Power Down Module IPU
#define CPM_LCR_P0S             0x02000000  // Big core CPU power down status.
                                            // 0: Big core CPU module not shut down
                                            // 1: Big core CPU module has entered shut down mode
#define CPM_LCR_P1S             0x01000000  // Small core CPU power down status
#define CPM_LCR_VPUS            0x00800000  // VPU power down status
#define CPM_LCR_GPUS            0x00400000  // GPU power down status
#define CPM_LCR_ISPS            0x00200000  // ISP power down status
#define CPM_LCR_H2DS            0x00100000  // H2D power down status
#define CPM_LCR_PST             0x000FFF00  // Power stability Time. Specifies the Power stabilize time by unit of
                                            // RTCCLK (approximate 32kHz) cycles
#define CPM_LCR_PDDMIC          0x00000080  // Power Dwon DMIC
#define CPM_LCR_DMICS           0x00000040  // DMIC pwer down status
#define CPM_LCR_IDLEDS          0x00000008  // When enter idle mode, set IDLE_DS to 1, the cache and p1`s RAM
                                            // enters rentention mode, software should set OPRCS.mask_int to 1
#define CPM_LCR_SLEEPDS         0x00000004  // When enter sleep mode, set SLEEP_DS 1, only OPCR.pd bit = 00,
                                            // Small core cpu and L2cache RAM enters retention mode. This is only don't shut down P0o or P1
#define CPM_LCR_LPM             0x00000003  // Low Power Mode. Specifies which low-power mode will be entered when SLEEP instruction is executed
                                            // 00: IDLE mode will be entered when SLEEP instruction is executed
                                            // 01: SLEEP mode will be entered when SLEEP instruction is executed

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PCR register.
//
//*****************************************************************************
#define CPM_PCR_ADACPD          0x80000000  // APLL DAC Power Down
                                            // 0: active mode 1: test mode
#define CPM_PCR_APLLBP          0x40000000  // APLL ByPass Mode
                                            // 0: not bypass 1: bypass mode
#define CPM_PCR_MDACPD          0x20000000  // MPLL DAC Power Down
                                            // 0: active mode 1: test mode
#define CPM_PCR_PLLST           0x000000FF  // PLL Stabilize Time. Specifies the PLL stabilize time by unit of RTCCLK
                                            // (approximate 32kHz) cycles. It is used when change PLL multiplier or
                                            // change PLL from off to on. It is initialized to H`20. It is used to control all PLL

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_APCR register.
// Note: VCO(Voltage Controlled Oscillator)
// APLLOD0 is connected to POSTDIV2, APLLOD1 is connected to POSTDIV1. and POSTDIV1 must be
// equal or greater than POSTDIV2. so APLLOD1 must be equal or greater than APLLOD0
//*****************************************************************************
#define CPM_APCR_APLLM          0xFFF00000  // APLL feedback 12-bit multiplication factor, NF = APLLM[11:0]
#define CPM_APCR_APLLN          0x000FC000  // APLL input reference 6-bit divider, NR = APLLN[5:0]
#define CPM_APCR_APLLOD1        0x00003800  // APLL post VCO divider1, OD1 = APLLOD1[2:0]
#define CPM_APCR_APLLOD0        0x00000700  // APLL post VCO divider0, OD0 = APLLOD0[2:0]
#define CPM_APCR_ADSMPD         0x00000080  // Power Down Delta-Sigma Modulator
                                            // 0: DSM is active
                                            // 1: DSM is power down
#define CPM_APCR_APHASEPD       0x00000040  // Power down 4 phase clock generator
                                            // 0: active 1: power down
#define CPM_APCR_APOSTDIVPD     0x00000020  // PLL post divide power down
                                            // 0: active 1: power down
#define CPM_APCR_AVCOPD         0x00000010  // VCO output Power Down
                                            // 0: active 1: power down
#define CPM_APCR_APLLON         0x00000008  // APLL ON Flag
                                            // 0: APLL is off or not stable
                                            // 1: APLL is on and stable
#define CPM_APCR_ALOCK          0x00000004  //
#define CPM_APCR_APLLEN         0x00000001  // APLL Enable. When APLLEN is set to 1, APLL starts to lock phase.
                                            // After APLL stabilizes, APLL_ON bit is set
                                            // When cpu enters sleep mode, the apllen must be set to 1

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_MPCR register.
// Note: MPLLOD0 is connected to POSTDIV2, MPLLOD1 is connected to POSTDIV1. and POSTDIV1 must be
// equal or greater than POSTDIV2. so MPLLOD1 must be equal or greater than MPLLOD0
//
//*****************************************************************************
#define CPM_MPCR_MPLLM          0xFFF00000  // MPLL feedback 12-bit multiplication factor, NF = MPLLM[11:0]
#define CPM_MPCR_MPLLN          0x000FC000  // MPLL input reference 6-bit divider, NR = MPLLN[5:0]
#define CPM_MPCR_MPLLOD1        0x00003800  // MPLL post VCO divider1, OD1 = MPLLOD1[2:0]
#define CPM_MPCR_MPLLOD0        0x00000700  // MPLL post VCO divider0, OD0 = MPLLOD0[2:0]
#define CPM_MPCR_MDSMPD         0x00000080  // Power Down Delta-Sigma Modulator(DSM)
                                            // 0: DSM is active
                                            // 1: DSM is power down
#define CPM_MPCR_MPHASEPD       0x00000040  // Power down 4 phase clock generator
                                            // 0: active 1: power down
#define CPM_MPCR_MPOSTDIVPD     0x00000020  // PLL post divide power down
                                            // 0: active 1: power down
#define CPM_MPCR_MVCOPD         0x00000010  // VCO output Power Down
                                            // 0: active 1: power down
#define CPM_MPCR_MPLLON         0x00000008  // MPLL ON Flag.
                                            // 0: MPLL is off or not stable
                                            // 1: MPLL is on and stable
#define CPM_MPCR_MLOCK          0x00000004  //
#define CPM_MPCR_MPLLEN         0x00000001  // MPLL Enable. When MPLLEN is set to 1, MPLL starts to lock phase.
                                            // After MPLL stabilizes, MPLL_ON bit is set

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_APACR register.
//
//*****************************************************************************
#define CPM_APACR_FRAC          0x00FFFFFF  // Fractional part of the APLL feedback divide value controlled by the
                                            // Delta-Sigma modulator. Total feedback divide value is (FBDIV + FRAC/2^24)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_MPACR register.
//
//*****************************************************************************
#define CPM_MPACR_FRAC          0x00FFFFFF  // Fractional part of the MPLL feedback divide value controlled by the
                                            // Delta-Sigma modulator. Total feedback divide value is (FBDIV + FRAC/2^24)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_CLKGR0 register.
//
//*****************************************************************************
#define CPM_CLKGR0_DDR          0x80000000  // Gate DDR's clock, 0: clock supply 1: stop supply
#define CPM_CLKGR0_TCU          0x40000000  // Gate TCU's pclk
#define CPM_CLKGR0_RTC          0x20000000  // Gate pclk of RTC on apb
#define CPM_CLKGR0_DES          0x10000000  // Gate DES's clock
#define CPM_CLKGR0_PCM          0x08000000  // Gate PCM's clock
#define CPM_CLKGR0_DSI          0x04000000  // Gate DSI's clock
#define CPM_CLKGR0_CSI          0x02000000  // Gate CSI's clock
#define CPM_CLKGR0_LCD          0x01000000  // Gate LCD's clock
#define CPM_CLKGR0_ISP          0x00800000  // Gate ISP's clock
#define CPM_CLKGR0_UHC          0x00400000  // Gate UHC's clock
#define CPM_CLKGR0_PDMA         0x00200000  // Gate PDMA's clock
#define CPM_CLKGR0_SSI2         0x00100000  // Gate SSI2's clock
#define CPM_CLKGR0_SSI1         0x00080000  // Gate SSI1's clock
#define CPM_CLKGR0_UART4        0x00040000  // Gate UART4's clock
#define CPM_CLKGR0_UART3        0x00020000  // Gate UART3's clock
#define CPM_CLKGR0_UART2        0x00010000  // Gate UART2's clock
#define CPM_CLKGR0_UART1        0x00008000  // Gate UART1's clock
#define CPM_CLKGR0_UART0        0x00004000  // Gate UART0's clock
#define CPM_CLKGR0_SADC         0x00002000  // Gate SADC's clock
#define CPM_CLKGR0_MSC2         0x00001000  // Gate MSC2's clock
#define CPM_CLKGR0_AIC          0x00000800  // Gate AIC's clock
#define CPM_CLKGR0_SMB3         0x00000400  // Gate SMB3's clock
#define CPM_CLKGR0_SMB2         0x00000200  // Gate SMB2's clock
#define CPM_CLKGR0_SMB1         0x00000100  // Gate SMB1's clock
#define CPM_CLKGR0_SMB0         0x00000080  // Gate SMB0's clock
#define CPM_CLKGR0_SSI0         0x00000040  // Gate SSI0's clock
#define CPM_CLKGR0_MSC1         0x00000020  // Gate MSC1's clock
#define CPM_CLKGR0_MSC0         0x00000010  // Gate MSC0's clock
#define CPM_CLKGR0_OTG          0x00000008  // Gate OTG's clock
#define CPM_CLKGR0_BCH          0x00000004  // Gate BCH's clock
#define CPM_CLKGR0_NEMC         0x00000002  // Gate NEMC's clock
#define CPM_CLKGR0_NFI          0x00000001  // Gate NFI's clock

