harviswang/linux-3.10.99/arch/mips/m200/inc/hw_cpm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_OPCR register.
//
//*****************************************************************************
#define CPM_OPCR_IDLEDIS        0x80000000  // 0: when CPU enters idle mode, CPU clock is stopped
                                            // 1: When CPU enters idle mode, CPU clock is not stopped
#define CPM_OPCR_MASKINT        0x40000000  // 0: interrupt not mask
                                            // 1: interrupt masked, When enters sleep/idle mode, cpu should set MASK_INT 1, hardware will clear.
#define CPM_OPCR_MASKVPU        0x20000000  // Don`t change this bit , it is only used to debug
#define CPM_OPCR_GPUACTIVE      0x10000000  // GPU active status
#define CPM_OPCR_L2CPD          0x08000000  // 0: L2MP doesn't power down
                                            // 1: L2MP power down when CPU enters sleep mode
#define CPM_OPCR_PD             0x06000000  // 00: CPU doesn't power down
                                            // 01: big core power down
                                            // 10: small core power down
                                            // 11: doesn't power down
#define CPM_OPCR_REQMODE        0x01000000  // 0: Before go into sleep mode, CPM send stop req signal to DDR
                                            // 1: Before go into sleep mode, CPM doesn't send stop req signal to DDR
                                            // When DDR enters retention mode, software should be set the bit to 1
#define CPM_OPCR_RTCLKEN        0x00800000  // 0: RTCLK isn't enable
                                            // 1: RTCLK enable
                                            // This bit control the rtclk to ssi0,ssi1,ssi2,sadc and usb
#define CPM_OPCR_O1ST           0x000FFF00  // EXCLK Oscillator Stabilize Time. This filed specifies the EXCLK oscillator stabilize time by unit of 16 RTCCLK periods
                                            // (oscillator stable time O1ST # 16 / 32768) cycles. It is initialized to H'15
#define CPM_OPCR_SPENDN0        0x00000080  // Force port0(otg) to enter suspend mode
                                            // 0: port0(otg) has forced to entered SUSPEND mode
                                            // 1: port0(otg) hasn`t forced to entered SUSPEND mode
#define CPM_OPCR_SPENDN1        0x00000040  // Force port1(uhc) to enter suspend mode
#define CPM_OPCR_O1SE           0x00000010  // EXCLK Oscillator Sleep Mode Enable. This filed controls the state of the EXCLK oscillator in Sleep mode
                                            // 0: EXCLK oscillator is disabled in Sleep mode
                                            // 1: EXCLK oscillator is enabled in Sleep mode
#define CPM_OPCR_ERCS           0x00000004  // EXCLK/512 clock and RTCLK clock selection
                                            // 0: select EXCLK/512 division ration clock
                                            // 1: select RTCLK clock
                                            // the clock only output to CPM INTC SSI TCU etc
#define CPM_OPCR_BUSMODE        0x00000002  // The default value is 0 When the value is 1, the BUS access is acclerated

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_CLKGR1 register.
//
//*****************************************************************************
#define CPM_CLKGR1_CPU          0x00008000  // This does not gate cpu clock
                                            // 0: cpm will give stp req to CPU
                                            // 1: cpm will not give stp req to CPU

#define CPM_CLKGR1_APB0         0x00004000  // This will gate p0clk of some modules on ahb0 whose slave port is apb. such ad ddr, csi and dsi
#define CPM_CLKGR1_DLINE        0x00002000  // Gate for delay_line's hclk
#define CPM_CLKGR1_TCUEXCLK     0x00001000  // Gate for TCU's EXCLK
#define CPM_CLKGR1_SYSOST       0x00000800  // Gate for sys_ost's hclk
#define CPM_CLKGR1_AHB0         0x00000400  // Gate for AHB0
#define CPM_CLKGR1_P0           0x00000200  // Gate for big cpu core
#define CPM_CLKGR1_P1           0x00000100  // Gate for small cpu core
#define CPM_CLKGR1_DMIC         0x00000080  // Gate for DMIC
                                            // 0: support clock for DMIC
                                            // 1: no clock for DMIC
#define CPM_CLKGR1_HASH         0x00000040  // Gate for HASH
#define CPM_CLKGR1_AES          0x00000020  // Gate for AES
#define CPM_CLKGR1_EPD          0x00000010  // Gate for EPD
#define CPM_CLKGR1_AHBMON       0x00000008  // TODO
#define CPM_CLKGR1_IPU          0x00000004  // Gate for IPU
#define CPM_CLKGR1_GPU          0x00000002  // Gate for GPU
#define CPM_CLKGR1_VPU          0x00000001  // Gate for VPU

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_DDRCDR register.
//
//*****************************************************************************
#define CPM_DDRCDR_DCS          0xC0000000  // DDR Clock Source Selection. Selects the DDR clock source between APLL output and MPLL output.
                                            // 00: stop MUX clock output
                                            // 01: DDR clock source is SCLK_A
                                            // 10: DDR clock source is MPLL
#define CPM_DDRCDR_CEDDR        0x20000000  // Change enable for DDR. If CE_DDR is 1 , write on DDRCDR will start a
                                            // frequency changing sequence immediately. If CE_DDR is 0, writes on has no effect
#define CPM_DDRCDR_DDRBUSY      0x10000000  // The bit is ready only bit. It indicates whether the frequency change has finished.
                                            // 0: indicates frequency change has finished
                                            // 1: indicates the frequency change is on going
#define CPM_DDRCDR_DDRSTOP      0x08000000  // When DDR_STOP is 1 and CE_DDR is 1, the DDR clock will stop
                                            // When DDR_STOP is 0 and CE_DDR is 1, the DDR clock will continue
                                            // DDR_STOP is prior to DDRCDR
#define CPM_DDRCDR_GATEEN       0x04000000  // 1: if ddr gives a clk stop request, cpm will gate ddr`s clk.
#define CPM_DDRCDR_CHANGEN      0x02000000  // When this bit set high ,cpm will change ddr`s clk when when CE_DDR is high and FLAG is low
#define CPM_DDRCDR_FLAG         0x01000000  // Will be set high when ddr gives relative flag, Can only be write zero by software
#define CPM_DDRCDR_DDRCDR       0x0000000F  // Divider for DDR Frequency. Specified the DDR memory clock division ratio, which varies from 1 to 16 (division ratio = DDRCDR + 1)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_VPUCDR register.
//
//*****************************************************************************
#define CPM_VPUCDR_VCS          0x80000000  // VPU Clock Source Selection. Selects the VPU clock source
                                            // 0: VPU clock source is SCLK_A
                                            // 1: VPU clock source is MPLL
#define CPM_VPUCDR_CEVPU        0x20000000  // Change enable for VPU. If CE_VPU is 1 , write on VPUCDR will start a
                                            // frequency changing sequence immediately. If CE_VPU is 0, writes on VPUCDR have no affect
#define CPM_VPUCDR_VPUBUSY      0x10000000  // 0: indicates frequency change has finished
                                            // 1: indicates the frequency change is on going
#define CPM_VPUCDR_VPUSTOP      0x08000000  // When VPU_STOP is 1 and CE_VPU is 1, the VPU clock will stop
                                            // When VPU_STOP is 0 and CE_VPU is 1, the VPU clock will continue
#define CPM_VPUCDR_VPUCDR       0x0000000F  // Divider for VPU Frequency. Specified the VPU clock division ratio, which varies from 1 to 16 (division ratio = VPUCDR + 1)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SPR register.
//
//*****************************************************************************
#define CPM_SPR_CPPSR           0xFFFFFFFF  // allows software to preserve some critical data

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SPPR register.
//
//*****************************************************************************
#define CPM_SPPR_CPSPPR         0x0000FFFF  // The value is only = 0x00005a5a, software can write the CPSPR

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_USBPCR0 register.
// Note: port1 is uhc, port 0 is otg
//*****************************************************************************
#define CPM_USBPCR0_USBMODE     0x80000000  // 0: work as USB device
                                            // 1: work as OTG
#define CPM_USBPCR0_AVLDREG     0x40000000  // This bit is used to set "avalid"(VBUS above A-device session threshold) signal
#define CPM_USBPCR0_IDPULLUPMASK 0x30000000 // These 2 bits control -idpullup# signal in otg mode
                                            // 00: use "idpullup" from otg controller
                                            // 01: "idpullup" always active when usb suspend
                                            // 10: "idpullup" always active
                                            // 11: "idpullup" always active
#define CPM_USBPCR0_INCRMASK    0x08000000  // This bit controls whether the ahb interface enhancement for
                                            // "incr transfer" takes effect. Set this bit to 0 will active the enhancement
#define CPM_USBPCR0_TXRISETUNE  0x04000000  // This bit adjusts the rise/fall times of the high-speed waveform
                                            // 0: default
                                            // 1: -8%
#define CPM_USBPCR0_COMMONONN   0x02000000  // This bit is the USB PHY common block power down control signal
                                            // 0: The common blocks remain powered in suspend mode
                                            // 1: The common blocks are powered down in suspend mode
#define CPM_USBPCR0_VBUSVLDEXT  0x01000000  // External VBUS Valid Indicator. This signal is valid in Device mode and only when the
                                            // VBUSVLDEXTSEL signal is set to 1`b1. VBUSVLDEXT indicates whether the VBUS signal on the USB cable is valid.
                                            // In addition, VBUSVLDEXT enables the pull-up resistor on the
                                            // D+ line. VBUSVLDEXT does not change the OTGSESSVLD0 output.
                                            // 0: The VBUS signal is not valid, and the pull-up resistor on D+ is disabled.
                                            // 1: The VBUS signal is valid, and the pull-up resistor on D+ is enabled
                                            // In Host mode, this input is not used.
#define CPM_USBPCR0_VBUSVLDEXTSEL 0x00800000 // External VBUS Valid Select. This signal selects either the VBUSVLDEXT input or the
                                            // internal Session Valid comparator to detect whether the VBUS signal on the USB cable is valid and to assert the DP pull-up resistor.
                                            // To avoid potential glitches in DP , VBUSVLDEXTSEL must be
                                            // static prior to a power-on reset and remain static during normal operation
                                            // 0: The internal Session Valid comparator is used to assert the DP pull-up resistor
                                            // 1: The VBUSVLDEXT input is used to assert the DP pull-up resistor
#define CPM_USBPCR0_POR         0x00400000  // This signal resets all test registers and state machines in the USB PHY
                                            // The POR signal must be asserted for a minimum of 10 µs.
                                            // 0: not reset 1: reset
                                            // Please make sure SUSPENDM = 1'b1, REFCLKDIV, REFCLKSEL and other USB PHY input signals value are correct before assert POR.
                                            // The PHYCLOCK will available after POR deasserted 45us
#define CPM_USBPCR0_SIDDQ       0x00200000  // This bit is the USB PHY analog blocks power down signal
                                            // Please make this bit to 0
#define CPM_USBPCR0_OTGDISABLE  0x00100000  // This bit is the power control for otg block in USB PHY
                                            // It can powers down the VBUS Valid comparator, but not the
                                            // Session Valid comparator,, nor the ID detection circuitry. To save power, if the application does not use the OTG function,
                                            // this input can be set high
                                            // 0: The OTG block is powered up
                                            // 1: The OTG block is powered down
#define CPM_USBPCR0_COMPDISTUNE 0x000E0000  // These bits control disconnect threshold adjustment.
                                            // 000: -6%
                                            // 001: -4.5%
                                            // 010: -3%
                                            // 011: -1.5%
                                            // 100: Default(0%)
                                            // 101: +1.5%
                                            // 110: +3%
                                            // 111: +4.5%
#define CPM_USBPCR0_OTGTUNE     0x0001C000  // These bits control VBUS valid threshold adjustment
                                            // 000: -6%
                                            // 001: -4.5%
                                            // 010: -3%
                                            // 011: -1.5%
                                            // 100: Default(0%)
                                            // 101: +1.5%
                                            // 110: +3%
                                            // 111: +4.5%
#define CPM_USBPCR0_SQRXTUNE    0x00003800  // These bits control squelch threshold adjustment
                                            // 000: +15%
                                            // 001: +10%
                                            // 010: +5%
                                            // 011: default
                                            // 100: -5%
                                            // 101: -10%
                                            // 110: -15%
                                            // 111: -20%
#define CPM_USBPCR0_TXFSLSTUNE  0x00000780  // These bits control FS/LS source impedance adjustment
                                            // 0000: +5%
                                            // 0001: +2.5%
                                            // 0011: Default
                                            // 0111: -2.5%
                                            // 1111: -5%
#define CPM_USBPCR0_TXPREEMPHTUNE 0x00000040// This bit controls HS transmitter Pre-emphasis enable
                                            // 0: disable 1: enable
#define CPM_USBPCR0_TXHSXVTUNE  0x00000030  // These bits adjust the voltage at which dp and dm signals cross while transmitting in HS mode.
                                            // 00: reserved
                                            // 01: -15mv
                                            // 10: +15mv
                                            // 11: Default
#define CPM_USBPCR0_TXVREFTUNE  0x0000000F  // These bits control HS DC voltage level adjustment
                                            // 0000: -6.25%
                                            // 0001: -5%
                                            // 0010: -3.75%
                                            // 0011: -2.5%
                                            // 0100: -1.25%
                                            // 0101: Default
                                            // 0110: +1.25%
                                            // 0111: +2.5%
                                            // 1000: +3.75%
                                            // 1001: +5%
                                            // 1010: +6.255%
                                            // 1011: +7.5%
                                            // 1100: +8.75%
                                            // 1101: +10%
                                            // 1110: +11.25%
                                            // 1111: +12.5%

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_USBRDT register.
//
//*****************************************************************************
#define CPM_USBRDT_HBMASK       0x04000000  // Halfword/Byte transfer support mask
                                            // 0: enable 1: mask
#define CPM_USBRDT_VBFILLDEN    0x02000000  // VBUS filter data load enable
#define CPM_USBRDT_IDDIGEN      0x01000000  // This bit indicates using CPM_USBRDT_IDDIGREG to control "iddig" signal.
#define CPM_USBRDT_IDDIGREG     0x00800000  // This bit controls "iddig" when CPM_USBRDT_IDDIGEN = 1'b1.
#define CPM_USBRDT_USBRDT       0x007FFFFF  // These bits control USB reset detect time

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_USBVBFIL register.
//
//*****************************************************************************
#define CPM_USBVBFIL_IDDIGFIL   0xFFFF0000  // These bits controls iddig jitter filter time
#define CPM_USBVBFIL_USBVBFIL   0x0000FFFF  // These bits controls VBUS jitter filter time

