harviswang/linux-3.10.99/arch/mips/m200/inc/hw_cpm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_USBPCR1 register.
// Note: port1 is uhc, port 0 is otg
//*****************************************************************************
#define CPM_USBPCR1_BVLDREG     0x80000000  // This bit is used to set "bvalid"(VBUS above B-device session threshold) signal
#define CPM_USBPCR1_REFCLKSEL   0x0C000000  // Reference Clock Select for USB PHY
                                            // 00: The XO block uses the clock from a crystal.
                                            // 01: The XO block uses an external, 2.5-V clock supplied on the XO pin.
                                            // 10: The PLL uses CLKCORE as reference.
                                            // 11: The PLL uses CLKCORE as reference.
                                            // This bus is a strapping option that must be set prior to a power-on reset
                                            // and remain static during normal operation. Please fix it to 2'b11 or 2'b10
#define CPM_USBPCR1_REFCLKDIV   0x03000000  // This bus selects the reference clock frequency
                                            // 00: 12MHz
                                            // 01: 24MHz
                                            // 10: 48MHz
                                            // 11: 19.2MHz
#define CPM_USBPCR1_DMPD1       0x00800000  // 0: The pull-down resistance on D- of port1 is disabled
                                            // 1: The pull-down resistance on D- of port1 is enabled
#define CPM_USBPCR1_DPPD1       0x00400000  // 0: The pull-down resistance on D+ of port1 is disabled
                                            // 1: The pull-down resistance on D+ of port1 is enabled
#define CPM_USBPCR1_PORT0RST    0x00200000  // Port0 reset
                                            // 0: The transmit and receive finite machines are operational, and the linestate inputs becomes sequential after 11 PHYCLOCK cycles
                                            // 1: The transmit and receive finite state machines are reset, and the linestate logic combinatorially reflects the state of the single-ended receivers
#define CPM_USBPCR1_PORT1RST    0x00100000  // 0: The transmit and receive finite machines are operational, and the linestate inputs becomes sequential after 11 PHYCLOCK cycles
                                            // 1: The transmit and receive finite state machines are reset, and the linestate logic combinatorially reflects the state of the single-ended receivers
#define CPM_USBPCR1_WORDIF0     0x00080000  // This bit selects utmi data bus width of port0
                                            // 0: 8bit/60M
                                            // 1: 16bit/30M
#define CPM_USBPCR1_COMPDISTUNE1 0x00038000 // These bits control disconnect threshold adjustment
                                            // 000: -6%
                                            // 001: -4.5%
                                            // 010: -3%
                                            // 011: -1.5%
                                            // 100: Default
                                            // 101: +1.5%
                                            // 110: +3%
                                            // 111: +4.5%
#define CPM_USBPCR1_SQRXTUNE1   0x00007000  // These bits control squelch threshold adjustment.
                                            // 000: +15%
                                            // 001: +10%
                                            // 010: +5%
                                            // 011: default
                                            // 100: -5%
                                            // 101: -10%
                                            // 110: -15%
                                            // 111: -20%
#define CPM_USBPCR1_TXFSLSTUNE1 0x00000F00  // These bits control FS/LS source impedance adjustment.
                                            // 0000: +5%
                                            // 0001: +2.5%
                                            // 0011: Default
                                            // 0111: -2.5%
                                            // 1111: -5%
#define CPM_USBPCR1_TXPREEMPHTUNE1 0x00000080 // This bit controls HS transmitter Pre-emphasis enable.
                                            // 0: disable 1: enable
#define CPM_USBPCR1_TXHSXVTUNE1 0x00000060  // These bits adjust the voltage at which dp and dm signals cross while transmitting in HS mode
                                            // 00: reserved
                                            // 01: -15mv
                                            // 10: +15mv
                                            // 11: Default
#define CPM_USBPCR1_TXVREFTUNE1 0x0000001E  // These bits control HS DC voltage level adjustment
                                            // 0000: -6.25%
                                            // 0001: -5%
                                            // 0010: -3.75%
                                            // 0011: -2.5%
                                            // 0100: -1.25%
                                            // 0101: Default
                                            // 0110: +1.25%
                                            // 0111: +2.5%
                                            // 1000: +3.75%
                                            // 1001: +5%
                                            // 1010: +6.255%
                                            // 1011: +7.5%
                                            // 1100: +8.75%
                                            // 1101: +10%
                                            // 1110: +11.25%
                                            // 1111: +12.5%
#define CPM_USBPCR1_TXRISETUNE1 0x00000001  // This bit adjusts the rise/fall times of the high-speed waveform
                                            // 0: default
                                            // 1: -8%

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_USBCDR register.
//
//*****************************************************************************
#define CPM_USBCDR_UCS          0x80000000  // USB Clock Source Selection. Selects the USB clock source between PLL output and pin EXCLK
                                            // 0: USB clock source is EXCLK
                                            // 1: USB clock source is PLL output divided by USBCDR
                                            // If UCS == 0, softwar should set USB_STOP bit to reduce power.It is no glitch
                                            // free mux. Software should be stop the module clock, when change this bit
#define CPM_USBCDR_UPCS         0x40000000  // 0: USB clock source is SCLK_A output
                                            // 1: USB clock source is MPLL output
#define CPM_USBCDR_CEUSB        0x20000000  // Change enable for USB. If CE_USB is 1 , write on USBCDR ill start a
                                            // frequency changing sequence immediately. If CE_USB is 0, writes on USBCDR have no affect
#define CPM_USBCDR_USBBUSY      0x10000000  // The bit is read only bit. It indicates whether the frequency change has finished
                                            // 0: indicates frequency change has finished
                                            // 1: indicates the frequency change is on going
#define CPM_USBCDR_USBSTOP      0x08000000  // When USB_STOP is 1 and CE_USB is 1, the USB clock will stop
                                            // When USB_STOP is 0 and CE_USB is 1, the USB clock will continue.
                                            // Software should wait until USB_BUSY == 0, may begin another frequency change
                                            // USB_STOP is prior to USBCDR. and USB_STOP will just stop clk from UPCS, and if UCS is high, usb phy`s CLKCORE will be stopped.
                                            // If system don't use this module, may set this bit to reduce power
#define CPM_USBCDR_USBEN        0x04000000  // 0: USB PHY clock is free runing
                                            // 1: USB PHY clock is shut off
#define CPM_USBCDR_MIPICS       0x02000000  // MIPI clock source selection
                                            // 0: MIPI use exclk
                                            // 1: MIPI use usb's clk
#define CPM_USBCDR_USBCDR       0x000000FF  // Divider for USB Frequency. Specified the USB device clock division ratio
                                            // division ratio = USBCDR + 1

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_I2SCDR register.
//
//*****************************************************************************
#define CPM_I2SCDR_I2SCS        0xC0000000  // 00: SCLK_A output
                                            // 01: MPLL output
                                            // 10: EXCLK
#define CPM_I2SCDR_CEI2S        0x20000000  // Change enable for I2S. If CE_I2S is 1 , write on I2SCDR will start a
                                            // frequency changing sequence immediately. If CE_I2S is 0, writes on I2SCDR have no affect
#define CPM_I2SCDR_I2SBUSY      0x10000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until I2S_BUSY == 0, may begin another frequency change.
#define CPM_I2SCDR_I2SSTOP      0x08000000  // When I2S_STOP is 1 and CE_I2S is 1, the I2S clock will stop.
                                            // When I2S_STOP is 0 and CE_I2S is 1, the I2S clock will continue.
                                            // Software should wait until I2S_BUSY == 0, may begin another frequency change.
                                            // I2S_STOP is prior to I2SCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_I2SCDR_I2SCDR       0x000000FF  // Divider for I2S Frequency. Specified the I2S device clock division ratio,
                                            // which varies from 1 to 256 (division ratio = I2SCDR + 1)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_LCDPCDR register.
//
//*****************************************************************************
#define CPM_LCDPCDR_LCDPCS      0x80000000  // 0: SCLK_A output
                                            // 1: MPLL output
                                            // It is no glitch free mux. Software should be stop PIX clock, when change this bit.
#define CPM_LCDPCDR_CELCD       0x10000000  // Change enable for LCD. If CE_LCD is 1 , write on LPCDR will start a
                                            // frequency changing sequence immediately. If CE_LCD is 0, writes on LPCDR have no affect
#define CPM_LCDPCDR_LCDBUSY     0x08000000  // The bit is read only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until LCD_BUSY == 0, may begin another frequency change
#define CPM_LCDPCDR_LCDSTOP     0x04000000  // When LCD_STOP is 1 and CE_LCD is 1, the LCD clock will stop.
                                            // When LCD_STOP is 0 and CE_LCD is 1, the LCD clock will continue.
                                            // Software should wait until LCD_BUSY == 0, may begin another frequency change.
                                            // LCD_STOP is prior to LPCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_LCDPCDR_LCDPCDR     0x000000FF  // Divider for Pixel Frequency. Specified the LCD pixel clock (LPCLK)
                                            // division ratio, which varies from 1 to 256 (division ratio = LPCDR + 1)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_MSC0CDR register.
//
//*****************************************************************************
#define CPM_MSC0CDR_MPCS        0x80000000  // 0: select SCLK_A clock output
                                            // 1: select MPLL clock output
                                            // The clock mux is not free of glitches if clock selection is changed
                                            // The clock mux output is to MSC0, MSC1, MSC2 . It is source clock of MSC0, MSC1, MSC2
#define CPM_MSC0CDR_CEMSC0      0x20000000  // Change enable for MSC0. If CE_MSC0 is 1 , write on MSC0CDR ill start a
                                            // frequency changing sequence immediately. If CE_MSC0 is 0, writes on MSC0CDR have no affect
#define CPM_MSC0CDR_MSC0BUSY    0x10000000  // The bit is read only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until MSC0_BUSY == 0, may begin another frequency change
#define CPM_MSC0CDR_MSC0STOP    0x08000000  // When MSC0_STOP is 1 and CE_MSC0 is 1, the MSC0 clock will stop.
                                            // When MSC0_STOP is 0 and CE_MSC0 is 1, the MSC0 clock will continue.
                                            // Software should wait until MSC0_BUSY == 0, may begin another
                                            // frequency change.MSC0_STOP is prior to MSC0CDR. If system don`t use this module, may set this bit to reduce power
#define CPM_MSC0CDR_SCLK0SEL    0x00008000  // MSC0 sample clock selection:
                                            // 0: Sample clock is 90-degree phase shifted by device clock
                                            // 1: Sample clock is 180-degree phase shifted by device clock
#define CPM_MSC0CDR_MSC0CDR     0x000000FF  // Divider for MSC0 Frequency. Specified the MSC0 device clock division
                                            // ratio division ratio = (MSC0CDR + 1)*2

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_UHCCDR register.
//
//*****************************************************************************
#define CPM_UHCCDR_UHCCS        0xC0000000  // 00: UHC clock source is SCLK_A output
                                            // 01: UHC clock source is MPLL output
                                            // 10: UHC clock source is USB_PHY
                                            // It is no glitch free mux. Software should be stop the module clock, when change this bit
                                            // When using USB_PHY, the UHCCDR should be = 0;
#define CPM_UHCCDR_CEUHC        0x20000000  // Change enable for UHC. If CE_UHC is 1 , write on UHCCDR ill start a
                                            // frequency changing sequence immediately. If CE_UHC is 0, writes on UHCCDR have no affect
#define CPM_UHCCDR_UHCBUSY      0x10000000  // The bit is read only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should wait until UHC_BUSY == 0, may begin another frequency change.
#define CPM_UHCCDR_UHCSTOP      0x08000000  // When UHC_STOP is 1 and CE_UHC is 1, the UHC clock will stop.
                                            // When UHC_STOP is 0 and CE_UHC is 1, the UHC clock will continue.
                                            // Software should wait until UHC_BUSY == 0, may begin another frequency change.
                                            // UHC_STOP is prior to UHCCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_UHCCDR_UHCCDR       0x000000FF  // Divider for UHC Frequency. Specified the UHC device clock division ratio
                                            // division ratio = UHCCDR + 1

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SSICDR register.
//
//*****************************************************************************
#define CPM_SSICDR_SSICS        0xC0000000  // 00: select SCLK_A output
                                            // 01: select MPLL output
                                            // 10: EXCLK
                                            // It is no glitch free mux. Software should be stop the module clock, when change this bit
#define CPM_SSICDR_CESSI        0x20000000  // Change enable for SSI. If CE_SSI is 1 , write on SSICDR will start a
                                            // frequency changing sequence immediately. If CE_SSI is 0, writes on SSICDR have no affect
#define CPM_SSICDR_SSIBUSY      0x10000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until SSI_BUSY == 0, may begin another frequency change
#define CPM_SSICDR_SSISTOP      0x08000000  // When SSI_STOP is 1 and CE_SSI is 1, the SSI clock will stop.
                                            // When SSI_STOP is 0 and CE_SSI is 1, the SSI clock will continue.
                                            // Software should wait until SSI_BUSY == 0, may begin another frequency change.
                                            // SSI_STOP is prior to SSICDR. If system don`t use this module, may set this bit to reduce power .
#define CPM_SSICDR_SSICDR       0x000000FF  // Divider for SSI Frequency. Specified the SSI device clock division
                                            // ratio, which varies from 1 to 256 (division ratio = SSICDR + 1).

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_CIMCDR register.
//
//*****************************************************************************
#define CPM_CIMCDR_CIMCS        0x80000000  // 0: select SCLK_A clock output
                                            // 1: select MPLL clock output
                                            // It is no glitch free mux. Software should be stop the module clock, when change this bit
#define CPM_CIMCDR_CECIM        0x40000000  // Change enable for CIM. If CE_CIM is 1 , write on CIMCDR ill start a
                                            // frequency changing sequence immediately. If CE_CIM is 0, writes on CIMCDR have no affect
#define CPM_CIMCDR_CIMBUSY      0x20000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until CIM_BUSY == 0, may begin another frequency change.
#define CPM_CIMCDR_CIMSTOP      0x10000000  // When CIM_STOP is 1 and CE_CIM is 1, the CIM clock will stop.
                                            // When CIM_STOP is 0 and CE_CIM is 1, the CIM clock will continue
                                            // Software should wait until CIM_BUSY == 0, may begin another frequency change.
                                            // CIM_STOP is prior to CIMCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_CIMCDR_CIMCDR       0x000000FF  // Divider for CIM MCLK Frequency. Specified the CIM MCLK clock
                                            // (CIM_MCLK) division ratio, which varies from 1 to 256 (division ratio = CIMCDR + 1). the output clk is io_setup.cim_mclk_o

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_ISPCDR register.
//
//*****************************************************************************
#define CPM_ISPCDR_ISPCS        0x80000000  // 0: select SCLK_A output
                                            // 1: select MPLL output
                                            // It is no glitch free mux. Software should be stop the module clock, when change this bit
#define CPM_ISPCDR_CEISP        0x20000000  // Change enable for ISP. If CE_ISP is 1 , write on ISPCDR ill start a
                                            // frequency changing sequence immediately. If CE_ISP is 0, writes on ISPCDR have no affect
#define CPM_ISPCDR_ISPBUSY      0x10000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until ISP_BUSY == 0, may begin another frequency change
#define CPM_ISPCDR_ISPSTOP      0x08000000  // When ISP_STOP is 1 and CE_ISP is 1, the ISP clock will stop.
                                            // When ISP_STOP is 0 and CE_ISP is 1, the ISP clock will continue.
                                            // Software should wait until ISP_BUSY == 0, may begin another frequency change.
                                            // ISP_STOP is prior to ISPCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_ISPCDR_ISPCDR       0x0000000F  // Divider for ISP Frequency. Specified the ISP clock division ratio, which
                                            // varies from 1 to 16 (division ratio = ISPCDR + 1).

