harviswang/linux-3.10.99/arch/mips/m200/inc/hw_cpm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PCMCDR register.
//
//*****************************************************************************
#define CPM_PCMCDR_PCMCS        0xC0000000  // 00: select SCLK_A output
                                            // 01: select MPLL output
                                            // 10: select EXCLK output
                                            // It is no glitch free mux. Software should be stop the module clock, when change this bit
#define CPM_PCMCDR_CEPCM        0x10000000  // Change enable for PCM. If CE_PCM is 1 , write on PCMCDR ill start a
                                            // frequency changing sequence immediately. If CE_PCM is 0, writes on PCMCDR have no affect
#define CPM_PCMCDR_PCMBUSY      0x08000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until PCM_BUSY == 0, may go next
#define CPM_PCMCDR_PCMSTOP      0x04000000  // When PCM_STOP is 1 and CE_PCM is 1, the PCM clock will stop.
                                            // When PCM_STOP is 0 and CE_PCM is 1, the PCM clock will continue.
                                            // Software should wait until PCM_BUSY == 0, may go next.
                                            // PCM_STOP is prior to PCMCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_PCMCDR_PCMCDR       0x000000FF  // Divider for PCM Frequency. Specified the PCM device clock division ratio,
                                            // which varies from 1 to 256 (division ratio = PCMCDR + 1).

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_GPUCDR register.
//
//*****************************************************************************
#define CPM_GPUCDR_GPUCS        0x80000000  // 0: select SCLK_A output
                                            // 1: select MPLL output
                                            // The clock mux is not free of glitches if clock selection is changed
#define CPM_GPUCDR_CEGPU        0x20000000  // Change enable for GPU. If CE_GPU is 1 , write on GPUCDR ill start a
                                            // frequency changing sequence immediately. If CE_GPU is 0, writes on GPUCDR have no affect
#define CPM_GPUCDR_GPUBUSY      0x10000000  // The bit is read only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until GPU_BUSY == 0, may begin another frequency change
#define CPM_GPUCDR_GPUSTOP      0x08000000  // When GPU_STOP is 1 and CE_GPU is 1, the GPU clock will stop.
                                            // When GPU_STOP is 0 and CE_GPU is 1, the GPU clock will continue.
                                            // Software should wait until GPU_BUSY == 0, may begin another frequency change.
                                            // GPU_STOP is prior to GPUCDR. If system don`t use this module, may set this bit to reduce power
#define CPM_GPUCDR_GPUCDR       0x0000000F  // Divider for GPU Frequency. Specified the GPU clock division ratio, which
                                            // varies from 1 to 16 (division ratio = GPUCDR + 1)

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PSWC0ST register.
// Note: The Start Time by the unit of PCLK cycles
//*****************************************************************************
#define CPM_PSWC0ST_PSWC0ST     0x00000FFF  // Power Switch Chain0 Start Time

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PSWC1ST register.
//
//*****************************************************************************
#define CPM_PSWC1ST_PSWC1ST     0x00000FFF  // Power Switch Chain1 Start Time

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PSWC2ST register.
//
//*****************************************************************************
#define CPM_PSWC2ST_PSWC2ST     0x00000FFF  // Power Switch Chain2 Start Time

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PSWC3ST register.
//
//*****************************************************************************
#define CPM_PSWC3ST_PSWC3ST     0x00000FFF  // Power Switch Chain3 Start Time

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_MSC1CDR register.
//
//*****************************************************************************
#define CPM_MSC1CDR_CEMSC1      0x20000000  // Change enable for MSC1. If CE_MSC1 is 1 , write on MSC1CDR ill start a
                                            // frequency changing sequence immediately. If CE_MSC1 is 0, writes on MSC1CDR have no affect
#define CPM_MSC1CDR_MSC1BUSY    0x10000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until MSC1_BUSY == 0, may go next
#define CPM_MSC1CDR_MSC1STOP    0x08000000  // When MSC1_STOP is 1 and CE_MSC1 is 1, the MSC1 clock will stop.
                                            // When MSC1_STOP is 0 and CE_MSC1 is 1, the MSC1 clock will continue.
                                            // Software should wait until MSC1_BUSY == 0, may begin another
                                            // frequency change.MSC1_STOP is prior to MSC1CDR.
                                            // If system don`t use this module, may set this bit to reduce power
#define CPM_MSC1CDR_SCLK1SEL    0x00008000  // MSC1 sample clock selection:
                                            // 0: Sample clock is 90-degree phase shifted by device clock
                                            // 1: Sample clock is 180-degree phase shifted by device clock
#define CPM_MSC1CDR_MSC1CDR     0x000000FF  // Divider for MSC1 Frequency. Specified the MSC1 device clock division
                                            // ratio division ratio = (MSC1CDR + 1)*2

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_MSC2CDR register.
//
//*****************************************************************************
#define CPM_MSC2CDR_CEMSC2      0x20000000  // Change enable for MSC2. If CE_MSC2 is 1 , write on MSC2CDR ill start a
                                            // frequency changing sequence immediately. If CE_MSC2 is 0, writes on MSC2CDR have no affect
#define CPM_MSC2CDR_MSC2BUSY    0x10000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until MSC2_BUSY == 0, may begin another frequency change
#define CPM_MSC2CDR_MSC2STOP    0x08000000  // When MSC2_STOP is 1 and CE_MSC2 is 1, the MSC2 clock will stop.
                                            // When MSC2_STOP is 0 and CE_MSC2 is 1, the MSC2 clock will continue.
                                            // Software should wait until MSC2_BUSY == 0, may begin another frequency change.
                                            // MSC2_STOP is prior to MSC2CDR. If system don`t use this module, may set this bit to reduce power
#define CPM_MSC2CDR_SCLK2SEL    0x00008000  // MSC2 sample clock selection:
                                            // 0: Sample clock is 90-degree phase shifted by device clock
                                            // 1: Sample clock is 180-degree phase shifted by device clock
#define CPM_MSC2CDR_MSC2CDR     0x000000FF  // Divider for MSC2 Frequency. Specified the MSC2 device clock division
                                            // ratio division ratio = (MSC2CDR + 1)*2.

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_BCHCDR register.
//
//*****************************************************************************
#define CPM_BCHCDR_BCHCS        0xC0000000  // 0: select SCLK_A output
                                            // 1: select MPLL output
                                            // The clock mux isn't free of glitches if clock selection is changed
                                            // When switching clock source, it should be ensured that the clock switched
                                            // from and the clock switched to are running.
#define CPM_BCHCDR_CEBCH        0x20000000  // Change enable for BCH. If CE_BCH is 1 , write on BCHCDR will start a
                                            // frequency changing sequence immediately. If CE_BCH is 0, writes on BCHCDR have no affect
#define CPM_BCHCDR_BCHBUSY      0x10000000  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until BCH_BUSY == 0, may begin another frequency change
#define CPM_BCHCDR_BCHSTOP      0x08000000  // When BCH_STOP is 1 and CE_BCH is 1, the BCH clock will stop.
                                            // When BCH_STOP is 0 and CE_BCH is 1, the BCH clock will continue.
                                            // Software should wait until BCH_BUSY == 0, may begin another frequency change.
                                            // BCH_STOP is prior to BCHCDR.
                                            // If system don`t use this module, may set this bit to reduce power
#define CPM_BCHCDR_BCHCDR       0x0000000F  // Divider for BCH Frequency. Specified the BCH clock division ratio, which
                                            // varies from 1 to 16 (division ratio = BCHCDR + 1).

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_INTR register.
//
//*****************************************************************************
#define CPM_INTR_VBUSINTR       0x00000002  // B device insert interrupt.
#define CPM_INTR_ADEVINTR       0x00000001  // A device insert interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_INTRE register.
//
//*****************************************************************************
#define CPM_INTRE_VBUSINTRE     0x00000002  // B device insert interrupt enable
#define CPM_INTRE_ADEVINTRE     0x00000001  // A device insert interrupt enable

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SPCR0 register.
//
//*****************************************************************************
#define CPM_SPCR0_PDMADS        0x80000000  // Deep sleep of pdma
#define CPM_SPCR0_NFI           0x08000000  // Memory Power control for NFI
                                            // 0: on 1: shutdown
#define CPM_SPCR0_AES           0x04000000  // Memory Power control for AES
#define CPM_SPCR0_SSI1          0x02000000  // Memory Power control for SSI1
#define CPM_SPCR0_PCM           0x01000000  // Memory Power control for PCM
#define CPM_SPCR0_SSI2          0x00800000  // Memory Power control for SSI2
#define CPM_SPCR0_I2S           0x00400000  // Memory Power control for I2S
#define CPM_SPCR0_TCU           0x00200000  // Memory Power control for TCU
#define CPM_SPCR0_UART4         0x00100000  // Memory Power control for UART4
#define CPM_SPCR0_UART3         0x00080000  // Memory Power control for UART3
#define CPM_SPCR0_UART2         0x00040000  // Memory Power control for UART2
#define CPM_SPCR0_UART1         0x00020000  // Memory Power control for UART1
#define CPM_SPCR0_UART0         0x00010000  // Memory Power control for UART0
#define CPM_SPCR0_PDMA          0x00008000  // Memory Power control for PDMA
#define CPM_SPCR0_UHC           0x00004000  // Memory Power control for UHC
#define CPM_SPCR0_MSC2          0x00002000  // Memory Power control for MSC2
#define CPM_SPCR0_MSC1          0x00001000  // Memory Power control for MSC1
#define CPM_SPCR0_OTG           0x00000800  // Memory Power control for OTG
#define CPM_SPCR0_LCD           0x00000400  // Memory Power control for LCD
#define CPM_SPCR0_EPD           0x00000200  // Memory Power control for EPD
#define CPM_SPCR0_DSI           0x00000100  // Memory Power control for DSI
#define CPM_SPCR0_DES           0x00000080  // Memory Power control for DES
#define CPM_SPCR0_SADC          0x00000040  // Memory Power control for SADC
#define CPM_SPCR0_SSI0          0x00000020  // Memory Power control for SSI0
#define CPM_SPCR0_MSC0          0x00000010  // Memory Power control for MSC0
#define CPM_SPCR0_BCH           0x00000008  // Memory Power control for BCH
#define CPM_SPCR0_AHB2BRI       0x00000004  // Memory Power control for AHB2_BRI
#define CPM_SPCR0_NEMC          0x00000002  // Memory Power control for NEMC
#define CPM_SPCR0_DDR           0x00000001  // Memory Power control for DDR

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SRBC register.
//
//*****************************************************************************
#define CPM_SRBC_VPUSR          0x80000000  // 0: VPU does not enter soft reset mode
                                            // 1: VPU enters soft reset mode
#define CPM_SRBC_VPUSTP         0x40000000  // Request for VPU to Stop bus transfer
#define CPM_SRBC_VPUACK         0x20000000  // VPU Stop Ack.
#define CPM_SRBC_GPUSR          0x10000000  // 0: GPU does not enter soft reset mode
                                            // 1: GPU enters soft reset mode
#define CPM_SRBC_GPUSTP         0x08000000  // Request for GPU to Stop bus transfer
#define CPM_SRBC_GPUACK         0x04000000  // GPU Stop Ack
#define CPM_SRBC_LCDSR          0x02000000  // 0: LCD does not enter soft reset mode
                                            // 1: LCD enters soft reset mode

