harviswang/linux-3.10.99/arch/mips/m200/inc/hw_cpm.h
#define CPM_SRBC_LCDSTP         0x01000000  // Request for LCD to Stop bus transfer
#define CPM_SRBC_LCDACK         0x00800000  // LCD Stop Ack
#define CPM_SRBC_ISPSR          0x00400000  // 0: ISP does not enter soft reset mode
                                            // 1: ISP enters soft reset mode
#define CPM_SRBC_ISPSTP         0x00200000  // Request for ISP to Stop bus transfer
#define CPM_SRBC_ISPACK         0x00100000  // ISP Stop Ack
#define CPM_SRBC_H2DSR          0x00080000  // 0: H2D does not enter soft reset mode
                                            // 1: H2D enters soft reset mode
#define CPM_SRBC_H2DSTP         0x00040000  // Request for H2D to Stop bus transfer.
#define CPM_SRBC_H2DACK         0x00020000  // H2D Stop Ack
#define CPM_SRBC_CPUSTP         0x00008000  // Request for CPU to Stop bus transfer.
#define CPM_SRBC_CPUACK         0x00004000  // CPU Stop Ack
#define CPM_SRBC_UHCSR          0x00002000  // UHC soft reset
#define CPM_SRBC_OTG1SR         0x00001000  // OTG1 soft reset
#define CPM_SRBC_OTG0SR         0x00000800  // OTG0 soft reset
#define CPM_SRBC_AHB0STP        0x00000400  // Request for AHB0 to Stop bus transfer
#define CPM_SRBC_AHB0ACK        0x00000200  // AHB0 Stop Ack
#define CPM_SRBC_AHB2STP        0x00000100  // Request for AHB2 to Stop bus transfer
#define CPM_SRBC_AHB2ACK        0x00000080  // AHB2 Stop Ack
#define CPM_SRBC_DDRSTP         0x00000040  // Request for DDR to Stop bus transfer
#define CPM_SRBC_DDRACK         0x00000020  // DDR Stop Ack

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SLBC register.
//
//*****************************************************************************
#define CPM_SLBC_SLBC           0x00000001  // 0: Sleep Mode Wake up Boot Process is same with any reset
                                            // 1: Sleep Mode Wake up Boot Process is jumped to SLPC, don`t care Boot_Sel.
                                            // The bit is only valid When shut down P0 in Sleep Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_SLPC register.
//
//*****************************************************************************
#define CPM_SLPC_SLPC           0xFFFFFFFF  // When SLBC is 1, sleep boot is jumped to SLPC, not true boot as any reset.
                                            // The bit is only valid When shut down P0 in Sleep Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_DDRCGR register.
//
//*****************************************************************************
#define CPM_DDRCGR_DRCG         0x000001FF  // Note: Please refer to DDR and NFI`s spec for detail use of this register.

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_CSR register.
//
//*****************************************************************************
#define CPM_CSR_H2DIVBUSY       0x00000004  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until H2DIV_BUSY == 0, then may begin another frequency change
#define CPM_CSR_H0DIVBUSY       0x00000002  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until H0DIV_BUSY == 0, then may begin another frequency change
#define CPM_CSR_CDIVBUSY        0x00000001  // The bit is ready only bit. It indicates whether the frequency change has
                                            // finished. When the bit is 0, it indicates frequency change has finished.,
                                            // otherwise it indicates the frequency change is on going
                                            // Software should be wait until CDIV_BUSY == 0, then may begin another frequency change.

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_ERNG register.
//
//*****************************************************************************
#define CPM_ERNG_READY          0x80000000  // Data ready
                                            // When software read RNG register, hardware auto clear ready to 0
#define CPM_ERNG_ERNG           0x00000001  // 0: not enable 1: enable

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_RNG register.
//
//*****************************************************************************
#define CPM_RNG_RNG             0xFFFFFFFF  // The RNG Register is a 32-bit read only register

//*****************************************************************************
//
// The following are defines for the bit fields in the CPM_O_PGR register.
//
//*****************************************************************************
#define CPM_PGR_BCHS            0x04000000  //
#define CPM_PGR_HASHS           0x02000000  //
#define CPM_PGR_LCDCS           0x00200000  //
#define CPM_PGR_USBS            0x00100000  //
#define CPM_PGR_UHCS            0x00080000  //
#define CPM_PGR_BCH             0x00000400  //
#define CPM_PGR_HASH            0x00000200  //
#define CPM_PGR_EPDC            0x00000040  // EPDC: do not change this bit
#define CPM_PGR_LCDC            0x00000020  //
#define CPM_PGR_USB             0x00000010  //
#define CPM_PGR_UHC             0x00000008  //
#define CPM_PGR_PFMON           0x00000004  //
#define CPM_PGR_CSI             0x00000002  //
#define CPM_PGR_DSI             0x00000001  //

#endif /* __HW_CPM_H__ */
